notes/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://www.haider.gq/base/table.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">Emacs</h1>
<div id="outline-container-org9e5c09f" class="outline-2">
<h2 id="org9e5c09f">Emacs</h2>
<div class="outline-text-2" id="text-org9e5c09f">
<p>
GNU Emacs isn’t a text editor, it’s the ultimate productivity environment for hackers.
</p>
</div>
<div id="outline-container-org621be7e" class="outline-3">
<h3 id="org621be7e">Emacs Packages</h3>
<div class="outline-text-3" id="text-org621be7e">
<p>
Emacs is Incredibly extensive and there are 1000s of packages people have made for it,
Here is a note on some I have documented: <a href="emacs_packages.html#ID-9198649d-5d1d-49fa-a84b-66f02797d8b4">Emacs Packages</a>
</p>
</div>
</div>
<div id="outline-container-org3648269" class="outline-3">
<h3 id="org3648269">IDE</h3>
<div class="outline-text-3" id="text-org3648269">
<p>
I Love Programming, and as a result, you would want a great IDE.
What's a better IDE than Emacs?
<a target='_blank' rel='noopener noreferrer' class='external' href="https://emacs-lsp.github.io/lsp-mode/">LSP-mode</a> allows you to use Language Server Protocol (LSP) in Emacs. (That's pretty insane)
I mainly use <a target='_blank' rel='noopener noreferrer' class='external' href="https://emacs-lsp.github.io/lsp-mode/">LSP-mode</a> with clangd (you can see more about clangd in <a href="cmake.html#ID-6a25d10a-fc17-4659-a714-0b7716d9de25">CMake</a>)
</p>
</div>
</div>
<div id="outline-container-org5bc77bb" class="outline-3">
<h3 id="org5bc77bb">Some useful keybinds</h3>
<div class="outline-text-3" id="text-org5bc77bb">
<p>
<b>Note that on my system, 'CTRL' is re-keybinded to 'CAPS LOCK' for erganomic and speed benifits</b>
</p>

<p>
C-j for return
C-i for tab
</p>
</div>
</div>
<div id="outline-container-org83d0c93" class="outline-3">
<h3 id="org83d0c93">Email</h3>
<div class="outline-text-3" id="text-org83d0c93">
<p>
Email in Emacs can use the <a href="mu4e.html#ID-d71d294a-b8e3-48e3-8295-3d373bcd9681">Mu4e</a> package which I use with mbsyncrc
</p>
</div>
</div>
<div id="outline-container-org814a356" class="outline-3">
<h3 id="org814a356">Issues</h3>
<div class="outline-text-3" id="text-org814a356">
</div>
<div id="outline-container-orgd4e2927" class="outline-4">
<h4 id="orgd4e2927">Emacs can't find guix package</h4>
<div class="outline-text-4" id="text-orgd4e2927">
<p>
If I ever encounter that Emacs cant find a package installed by <a href="guix.html#ID-4ce84157-a404-40fa-bdb8-0b3923916969">Guix</a>, I found a tempoary solution online:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">let</span> ((default-directory  <span style="font-style: italic;">"/home/haider/.guix-extra-profiles/mail/mail/share/emacs/site-lisp"</span>))
  (normal-top-level-add-subdirs-to-load-path))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org66f9885" class="outline-2">
<h2 id="org66f9885">Links to this note</h2>
<div class="outline-text-2" id="text-org66f9885">
<ul class="org-ul">
<li><a href="./mu4e.html">Mu4e</a></li>
<li><a href="./transient.html">Transient</a></li>
<li><a href="./cmake.html">CMake</a></li>
<li><a href="./org_mode.html">Orgmode</a></li>
<li><a href="./org_mode.html">Orgmode</a></li>
<li><a href="./notmuch.html">Notmuch</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:haider@haider.gq'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgmode in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
